var lis = [
    ["나는", "님은", "저는"],
    ["하였네요.", "했다."],
    ["보았네요.", "봤다."],
    ["쳤습니다.","쳤다."],
    ["쌌습니다.","쌌다."],
    ["해주세요.", "해요."],
    ["샀습니다.","샀다."],
    ["었습니다.","었다."],
    ["먹습니다.","먹다."],
    ["있습니다.", "있다."],
    ["좋습니다.", "좋다."],
    ["많습니다.", "많다."],
    ["되었습니다.", "된다."],
    ["시켰네요.", "시킨다."],
    ["왔습니다.", "온다."],
    ["뤘습니다.", "룬다."],
    ["친거죠.", "친다."],
    ["눴습니다.", "눴다."],
    ["기는데요.", "긴다."],
    ["누었네요.", "눈다."],
    ["린거죠.", "린다."],
    ["켰습니다.", "켰다."],
    ["없습니다.", "없다."],
    ["하겠습니다.","하겠다."],
    ["다가옵니다.","다가온다."],
    ["필수입니다.","필수다."],
    ["생깁니다.","생긴다."],
    ["웠네요.","운다."],
    ["않습니다.","않는다."],
    ["보겠습니다.","보겠다."],
    ["하십니다.","하신다."],
    ["가능합니다.","가능하다."],
    ["방송","녹화"],
    ["하였습니다.", "하였다."],
    ["중요합니다." , "중요하다."],
    ["바랍니다.","바란다."],
    ["나옵니다.","나온다."],
    ["놓았습니다.", "놓았다."],
    ["됐습니다.", "됐다."],
    ["였네요.", "였다."],
    ["졌는데요.", "졌다."],
    ["렸습니다.", "렸다."],
    ["즐겼는데요.", "즐겼다."],
    ["았습니다.", "았다."],
    ["냈네요.", "냈다."],
    ["어렵습니다.", "어렵다."],
    ["혔습니다.", "혔다."],
    ["네티즌", "누리꾼"],
    ["세웠네요.", "세운다."],
    ["세웠네요.", "세웠다."],
    ["린건데요.", "렸다."],
    ["한건데요.", "한다고."],
    ["오른거죠.", "오른다."],
    ["선거죠.", "선다."],
    ["것이죠.", "것."],
    ["일으키네요.", "돋운다."],
    ["놨습니다.", "놨다."],
    ["상태라네요.", "상태다."],
    ["했습니다.", "한다."],
    ["파헤쳤네요.", "파헤친다."],
    ["파헤쳤네요.", "파헤쳤다."],
    ["거죠.", "다고."],
    ["랐습니다.", "랐다."],
    ["립니다.", "린다."],
    ["는건데요.", "는다."],
    ["모았습니다.", "모은다."],
    ["겼네요.", "겼다."],
    ["졌네요.", "진다."],
    ["방송", "방송되는"],
    ["안타까운 사연", "사연"],
    ["분노를", "공분을"],
    ["화가난", "분노한"],
    ["고백", "토로"],
    ["다녔습니다.", "다녔다."],
    ["보는이", "시청자"],
    ["났습니다.", "났다."],
    ["메이크업", "화장"],
    ["화장", "메이크업"],
    ["휴대폰", "핸드폰"],
    ["갔습니다.", "갔다."],
    ["시켰습니다.", "시켰다."],
    ["취업", "취직"],
    ["난거죠.", "난다."],
    ["연거죠.", "연다."],
    ["", "더보기"],
    ["", "[1]"],
    ["", "[2]"],
    ["", "[3]"],
    ["", "[4]"],
    ["", "[5]"],
    ["", "[6]"],
    ["", "[7]"],
    ["", "[8]"],
    ["", "[9]"],
    ["", "[10]"],
    ["보는이", "시청자"],
    ["연거죠.", "연다."],
    ["왔습니다.", "왔다."],
    ["방송", "방송될"],
    ["방송", "방송되는"],
    ["방송", "방송하는"],
    ["방송", "방송 예정인"],
    ["방송", "방송할"],
    ["바라며", "꿈꾸며"],
    ["놓은건데요.", "놓는다."],
    ["했습니다.", "했다는 후문이다."],
    ["냅니다.", "낸다."],
    ["끈건데요.", "끈다."],
    ["준건데요.", "준다."],
    ["본건데요.", "본다."],
    ["높이네요.", "높인다."],
    ["였습니다.", "인다."],
    ["웠죠.", "웠다."],
    ["일으킨거죠.", "일으킨다."],
    ["관심사죠.", "관심사다."],
    ["만거죠.", "만다."],
    ["", "(오늘)"],
    ["간거죠.", "간다."],
    ["펼친거죠.", "펼친다."],
    ["만든거죠.", "만든다."],
    ["인데요.", "이다."],
    ["스케쥴", "일정"],
    ["렀습니다.", "렀다."],
    ["뛰네요.", "뛴다."],
    ["섰습니다.", "섰다."],
    ["롭습니다.", "롭다."],
    ["마친거죠.", "마친다."],
    ["지 궁금해 지는데요.", "까?"],
    ["지 궁금해 지는데요.", "까."]
];



function value_check(){
    var check_cnt = document.getElementsByName("lan").length;
    for (var i=0; i<check_cnt;i++){
        if (document.getElementsByName("lan")[0].checked == true) {
            low_high();
            break        
        }else if(document.getElementsByName("lan")[1].checked == true){
            high_low();
            break;

        }
    }   
}
String.prototype.replace = function(org, dest) {
    return this.split(org).join(dest);
}

//  입니다 이다 이다 입니다 한다 한다 합니다 합니다
function low_high(){
    for(var i=0; i<lis.length;i++){
        resultString = resultString.replace(lis[i][1],lis[i][0]);
    }
}

function high_low(){
    for(var i=0; i<lis.length;i++){
        resultString = resultString.replace(lis[i][0],lis[i][1]);
    }
}

function resize(obj) {
    obj.style.height = "1px";
    obj.style.height = 12 + obj.scrollHeight + "px";
}

